
## :white_check_mark: Apply Succeeded (shareable-lists-api-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/84203)



<pre><code>Apply complete! Resources: 2 added, 2 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Reading...
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ShareableListsApi-Dev-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
data.aws_region.region: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/02103b2f-b0bd-4f70-bcd0-d4267706486f]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Read complete after 0s [id=1349007126]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_kms_alias.kms_alias: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-shareablelistsapi-dev-synthetic-checks]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/ShareableListsApi-Dev]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=shareablelistsapi-dev-app]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125: Refreshing state... [id=210b1182-15ba-4619-8b5b-ede038bf13a3:ShareableListsApi-Dev-Sqs-Event-Consumer-Lambda]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ShareableListsApi-Dev-SNS-Topic-DLQ]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Read complete after 0s [id=4250039221]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z06964661Q049U5YCUIPY]
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Read complete after 0s [id=2591764522]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=ZCSIDA846KWLN]
aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E: Refreshing state... [id=pocket-shareablelistsapi-dev-sqs-event-consumer]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=75bd402d-b400-49ec-b84d-deabd3610dab:ShareableListsApi-Dev-ECS]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ShareableListsApi-Dev/ecs/app]
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-shareablelistsapi-dev-synthetic-check]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2: Refreshing state... [id=ShareableListsApi-Dev-Sqs-Event-Consumer-ExecutionRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1519502492]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ShareableListsApi-Dev-Sqs-Event-Consumer-Queue]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=1741089787]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ShareableListsApi-Dev-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ShareableListsApi-Dev-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ShareableListsApi-Dev-ECSCodeDeployRole]
aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46: Refreshing state... [id=ShareableListsApi-Dev-Sqs-Event-Consumer-CodeDeployRole]
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Reading...
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Read complete after 0s [id=341341075]
aws_iam_policy.sqs-event-consumer_lambda_execution-policy_4069CEFE: Refreshing state... [id=arn:aws:iam::410318598490:policy/ShareableListsApi-Dev-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=shareablelistsapi-dev-app]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/ShareableListsApi-Dev-TaskRolePolicy]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z06964661Q049U5YCUIPY__c1548ca5376b3547e3e764880567e85b.shareablelistsapi.getpocket.dev._CNAME]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_shareablelistsapi.getpocket.dev_NS]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/ShareableListsApi-Dev-TaskExecutionRolePolicy]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/1697839afbe3f3a5f446fe9eadf3d2cbc3b6cb98]
aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:9aa3aec6-d554-4657-b416-1fb8127bb8ab]
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Read complete after 0s [id=3600750957]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ShareableListsApi-Dev-SNS-Topic-DLQ]
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-shareablelistsapi-dev-synthetic-checks]
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Read complete after 0s [id=1631267042]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=3880790197]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ShareableListsApi-Dev-TaskExecutionRole-20230203214315782800000009]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda_execution-role-policy-attachment_B4842CE7: Refreshing state... [id=ShareableListsApi-Dev-Sqs-Event-Consumer-ExecutionRole-20230419195853522300000002]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ShareableListsApi-Dev-ECSCodeDeployRole-20230203214315761100000008]
aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807: Refreshing state... [id=026adfbb-42b0-4cad-849d-26419d4e6b5b]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_5F4F021D: Refreshing state... [id=ShareableListsApi-Dev-Sqs-Event-Consumer-CodeDeployRole-20230419195853508900000001]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ShareableListsApi-Dev-TaskRole-2023020321431587140000000b]
aws_s3_bucket_ownership_controls.sqs-event-consumer_lambda_code-bucket-ownership-controls_E3CCA008: Refreshing state... [id=pocket-shareablelistsapi-dev-sqs-event-consumer]
aws_s3_bucket_public_access_block.sqs-event-consumer_lambda_code-bucket-public-access-block_BB3EE815: Refreshing state... [id=pocket-shareablelistsapi-dev-sqs-event-consumer]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ShareableListsApi-Dev-Sqs-Event-Consumer-Queue]
aws_iam_policy.sqs-event-consumer_sqs-policy_9FE8B4E1: Refreshing state... [id=arn:aws:iam::410318598490:policy/ShareableListsApi-Dev-Sqs-Event-Consumer-LambdaSQSPolicy]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/SLAPIg20230203214315452000000006/a19e2af49adce20e]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/SLAPIb20230203214315066500000002/f6a09a7bb41d20b4]
data.aws_vpc.rds_vpc_9E5B9996: Reading...
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::410318598490:policy/pocket-shareablelistsapi-dev-synthetic-check-access]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-02e0adf82621b0725]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ShareableListsApi-Dev-TaskExecutionRole-2023020321431582400000000a]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2023-02-03 21:44:38.465 +0000 UTC]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
aws_s3_bucket_acl.sqs-event-consumer_lambda_code-bucket-acl_8FA13E85: Refreshing state... [id=pocket-shareablelistsapi-dev-sqs-event-consumer,private]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-shareablelistsapi-dev-synthetic-check-20230531170951568800000001]
aws_iam_role_policy_attachment.sqs-event-consumer_execution-role-policy-attachment_2A5E0086: Refreshing state... [id=ShareableListsApi-Dev-Sqs-Event-Consumer-ExecutionRole-20230419195943460500000003]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-01ccb2d62f97f6841]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/SLAPI2023020321431792390000000c/43ca85d05c829758]
data.aws_subnets.cache_private_subnet_ids: Reading...
aws_db_subnet_group.rds_rds_subnet_group_796D20B7: Refreshing state... [id=shareablelistsapi-dev20230207064907537600000001]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=slapi-dev-uptime-0]
aws_lambda_function.sqs-event-consumer_lambda_477DAF53: Refreshing state... [id=ShareableListsApi-Dev-Sqs-Event-Consumer-Function]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B: Refreshing state... [id=slapi-dev-query-0]
data.aws_vpc.rds_vpc_9E5B9996: Read complete after 1s [id=vpc-012481e83ffa5e152]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_security_group.rds_rds_security_group_B7738CEB: Refreshing state... [id=sg-02f7b70b9d7768f08]
data.aws_subnets.cache_private_subnet_ids: Read complete after 1s [id=us-east-1]
aws_security_group.serverless_redis_elasticache_security_group_31FA49DF: Refreshing state... [id=sg-0eb9a3c7726b197a4]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21: Refreshing state... [id=slapi-dev-query-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Refreshing state... [id=slapi-dev-uptime-0]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Refreshing state... [id=shareablelistsapi-dev-serverless]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/SLAPI2023020321431792390000000c/43ca85d05c829758/15d80671248c466c]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/SLAPI2023020321431792390000000c/43ca85d05c829758/196e6a2d86e4a5db]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z06964661Q049U5YCUIPY_shareablelistsapi.getpocket.dev_A_1]
aws_rds_cluster.rds_rds_cluster_1A0399FD: Refreshing state... [id=shareablelistsapi-dev20230207071137766400000001]
aws_lambda_alias.sqs-event-consumer_lambda_alias_8B8F9784: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:ShareableListsApi-Dev-Sqs-Event-Consumer-Function:DEPLOYED]
aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF: Refreshing state... [id=/aws/lambda/ShareableListsApi-Dev-Sqs-Event-Consumer-Function]
aws_lambda_event_source_mapping.sqs-event-consumer_lambda_event_source_mapping_5E8B497D: Refreshing state... [id=21588825-66ca-416a-815e-2f4ef44d7fe0]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/SLAPI2023020321431792390000000c/43ca85d05c829758/196e6a2d86e4a5db/dce6ec2557647418]
aws_secretsmanager_secret.rds_rds_secret_A0401B27: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:410318598490:secret:ShareableListsApi-Dev/shareablelistsapi-dev20230207071137766400000001-YyJWDQ]
aws_rds_cluster_instance.rds_rds-instance_6675FA88: Refreshing state... [id=shareablelistsapi-dev20230207071137766400000001-serverless]
aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:410318598490:secret:ShareableListsApi-Dev/shareablelistsapi-dev20230207071137766400000001-YyJWDQ|FD01EA6E-BEA2-452D-8EF5-9CB051AAF7AE]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ShareableListsApi-Dev]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=8918c69049efd75a7d3ebf93ea1a4fc0a2718b0e]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/ShareableListsApi-Dev/ShareableListsApi-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ShareableListsApi-Dev/ShareableListsApi-Dev]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=ea25a8e1-1561-463d-9d9a-cae1b7a19345]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ShareableListsApi-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ShareableListsApi-Dev-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ShareableListsApi-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ShareableListsApi-Dev Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ShareableListsApi-Dev Service Low CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21" {
      ~ alarm_actions             = [
          + "",
        ]
        id                        = "slapi-dev-query-0"
      ~ ok_actions                = [
          + "",
        ]
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7" {
      ~ alarm_actions             = [
          + "",
        ]
        id                        = "slapi-dev-uptime-0"
      ~ ok_actions                = [
          + "",
        ]
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/ShareableListsApi-Dev:187" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/ShareableListsApi-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "410318598490.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-dev-app:01b0b9755351243e5084273feca126509bb47a86" -> "410318598490.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-dev-app:97ef07a082d7c605e3a7d568b6a329784805eaa4"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ShareableListsApi-Dev" -> (known after apply)
      ~ revision                 = 187 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "ShareableListsApi"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ShareableListsApi-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21: Modifying... [id=slapi-dev-query-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Modifying... [id=slapi-dev-uptime-0]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ShareableListsApi-Dev]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=41206c3b7f0a2f808fc006e9811cfe8303955a0a]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21: Modifications complete after 0s [id=slapi-dev-query-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Modifications complete after 0s [id=slapi-dev-uptime-0]

Apply complete! Resources: 2 added, 2 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"9183410f-ac4f-4db6-ad49-33a57570490a","JobName":"shareable-lists-api_infrastructure_apply_dev","PRNumber":287,"Program":"tfcmt","SHA1":"97ef07a082d7c605e3a7d568b6a329784805eaa4","Target":"shareable-lists-api-cdk-dev","Vars":{}} -->